.emacs.d/emacs-init.org
#+TITLE: Emacs Configuration
#+AUTHOR: David Buchmann
#+EMAIL: david.buchmann@gmail.com
#+OPTIONS: toc:3 num:nil ^:nil

* About
  This is my emacs configuration written in [[http://orgmode.org][Org mode]].

* Keybindings
#+BEGIN_SRC emacs-lisp
(defun other-window-backward ()
  "Select the previous window."
  (interactive)
  (other-window -1))

(defun duplicate-region ()
  (let* ((end (region-end))
         (text (buffer-substring (region-beginning)
                                 end)))
    (goto-char end)
    (insert text)
    (push-mark end)
    (setq deactivate-mark nil)
    (exchange-point-and-mark)
  )
)

(defun duplicate-line()
  (interactive)
  (move-beginning-of-line 1)
  (kill-line)
  (yank)
  (open-line 1)
  (next-line 1)
  (yank)
)

(defun duplicate-line-or-region ()
  (interactive)
  (if mark-active
      (duplicate-region)
      (duplicate-line)
  )
)

(defun json-format ()
  (interactive)
  (save-excursion
    (shell-command-on-region (mark) (point) "python -m json.tool" (buffer-name) t)
  )
)
;; make zap-to-char act like zap-up-to-char
(autoload 'zap-up-to-char "misc"
  "Kill up to, but not including ARGth occurrence of CHAR.
  \(fn arg char)"
    'interactive)

(defun zap-to-char-save (arg char)
  "Zap to a character, but save instead of kill."
  (interactive "p\ncZap to char: ")
  (save-excursion
    (zap-up-to-char arg char)
    (yank)))


; Make join line not leave a space.
(defun join-previous-line ()
  (interactive)
  (join-line -1)
  (delete-char 1)
)

(defun forward-or-backward-sexp (&optional arg)
  "Go to the matching parenthesis character if one is adjacent to point."
  (interactive "^p")
  (cond ((looking-at "\\s(") (forward-sexp arg))
        ((looking-back "\\s)" 1) (backward-sexp arg))
        ;; Now, try to succeed from inside of a bracket
        ((looking-at "\\s)") (forward-char) (backward-sexp arg))
        ((looking-back "\\s(" 1) (backward-char) (forward-sexp arg))))

(global-set-key (kbd "C-S-d") 'duplicate-line-or-region)
(global-set-key "\C-xp" 'other-window-backward)
(global-set-key (kbd "M-z") 'zap-up-to-char)
(global-set-key (kbd "M-Z") 'zap-to-char-save)
(global-set-key (kbd "M-j") 'join-previous-line)
(global-set-key (kbd "C-c j") 'json-format)
(global-set-key (kbd "M-`") 'isearch-forward-symbol-at-point)
(if (eq system-type 'darwin)
    (global-set-key (kbd "s-M") 'toggle-max-frame)
)
(global-set-key (kbd "C-z") 'undo)
(global-set-key (kbd "s-/") 'comment-dwim)

(global-set-key [f3] 'flymake-display-err-menu-for-current-line)
(global-set-key [f4] 'flymake-goto-next-error)
(global-set-key [(f6)] 'clipboard-kill-ring-save)
(global-set-key [(f7)] 'clipboard-yank)
(global-set-key [(f9)] 'recompile)
(global-set-key [f10] 'compile)
(global-set-key [(f11)] 'my-toggle-fullscreen)
(global-set-key [F12] 'recompile)

(global-set-key (kbd "<XF86AudioPlay>") 'spotify-playpause)
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "C-c `") 'org-agenda)

#+END_SRC
* Global settings
** Backend settings
#+BEGIN_SRC emacs-lisp
(setq inhibit-splash-screen t)
(column-number-mode)
(require 'server)
(unless (server-running-p) (server-start))
(ido-mode t)
(setq ido-case-fold  t)
(fset 'yes-or-no-p 'y-or-n-p)

(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))

;Buffer settings
(setq confirm-kill-emacs #'yes-or-no-p)
(require 'uniquify)
(setq uniquify-buffer-name-style 'reverse)
(setq kill-buffer-query-functions
  (remq 'process-kill-buffer-query-function
         kill-buffer-query-functions))
(blink-cursor-mode (- (*) (*) (*)))
;(toggle-show-tabs-show-ws)
(add-hook 'doc-view-mode-hook 'auto-revert-mode)
(setq ring-bell-function 'ignore)
(delete-selection-mode 1)
(setq scss-compile-at-save nil)
(setq bookmark-save-flag 1)
(show-paren-mode 1)
(global-auto-revert-mode 1)
(setq backup-directory-alist
      `(("." . ,(expand-file-name
                 (concat user-emacs-directory "backups")))))
(setq vc-make-backup-files t)
(require 'saveplace)
(setq-default save-place t)
(setq save-place-file (expand-file-name ".places" user-emacs-directory))
(defvar local-directory
  (concat user-emacs-directory ".local/")
  "This variable dictates where to put auto saves"
)

(setq auto-save-list-file-prefix nil)
(setq backup-directory-alist `((".*" . ,local-directory)))
(setq auto-save-file-name-transforms  `((".*" ,local-directory t)))
(setq recentf-save-file (expand-file-name "recentf" local-directory))
(setq compilation-scroll-output t)
(setq gc-cons-threshold 40000000)
(org-babel-do-load-languages
 'org-babel-load-languages '((emacs-lisp . t) (shell . t) (C . t) (python . t)))

(setq ediff-window-setup-function 'ediff-setup-windows-plain)
(setq ediff-split-window-function 'split-window-horizontally)
(defun flymake-display-warning (warning) 
  "Display a warning to the user, using lwarn"
  (message warning))
(setq 
 gdb-many-windows t
 gdb-show-main t
)

(setenv "GOPATH" "/home/david/src/go")
(when (eq system-type 'darwin)
  (require 'exec-path-from-shell)
  (setq exec-path-from-shell-check-startup-files nil)
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-env "GOPATH")
  (exec-path-from-shell-copy-env "PATH")
  (exec-path-from-shell-copy-env "PYTHONPATH")
)
#+END_SRC
