.emacs.d/emacs-init.org
** Look and feel
#+BEGIN_SRC emacs-lisp
(use-package zenburn-theme
  :ensure t
  :config
  (load-theme 'zenburn t)
  ;; scale headings in org-mode
  (setq zenburn-scale-org-headlines t)
  ;; scale headings in outline-mode
  (setq zenburn-scale-outline-headlines t)
)

(setq-default scroll-up-aggressively 0)
(setq-default scroll-down-aggressively 0)
(setq-default scroll-margin 3)

(setq org-todo-keyword-faces
      (quote (("TODO"      :foreground "red"          :weight bold)
              ("BACKLOG"   :foreground "light blue"         :weight bold)
              ("NEXT"      :foreground "blue"         :weight bold)
              ("DONE"      :foreground "forest green" :weight bold)
              ("IN-PROGRESS"   :foreground "hotpink"         :weight bold)
              ("SELECTED-FOR-DEVELOPMENT"   :foreground "yellow"  :weight bold)
              ("WAITING"   :foreground "yellow"       :weight bold)
              ("SOMEDAY"   :foreground "goldenrod"    :weight bold)
              ("CANCELLED" :foreground "orangered"    :weight bold)
              ("QUOTE"     :foreground "hotpink"      :weight bold)
              ("QUOTED"    :foreground "indianred1"   :weight bold)
              ("APPROVED"  :foreground "forest green" :weight bold)
              ("EXPIRED"   :foreground "olivedrab1"   :weight bold)
              ("REJECTED"  :foreground "olivedrab"    :weight bold)
              ("OPEN"      :foreground "magenta"      :weight bold)
              ("CLOSED"    :foreground "forest green" :weight bold))))

(defun fontify-frame (frame)
  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(mode-line ((t (:background "#7F7F7F" :foreground "#8FB28F" :box nil)))) 
   '(js2-error ((((class color)) (:underline "red"))))
   '(js2-external-variable ((((class color)) (:underline "red"))))
   '(flymake-errline ((((class color)) (:underline "red"))))
   '(flymake-warnline ((((class color)) (:underline "yellow")))))
  (if (eq system-type 'darwin)
      (progn
        (set-frame-parameter frame 'font '"Source Code Pro for Powerline 13")
        (set-frame-font "Source Code Pro for Powerline 13")
        )
    (set-frame-font "Source Code Pro for Powerline 9")
    (set-frame-parameter frame 'font '"Source Code Pro for Powerline 9")
  )
)

;; Fontify current frame
(fontify-frame nil)
;; Fontify any future frames
(push 'fontify-frame after-make-frame-functions)

(if (eq system-type 'darwin)
    (set-frame-font "Source Code Pro for Powerline 13")
  (if (string= system-name "checkers")
      (set-frame-font "Monospace 11")
    (set-frame-font "Source Code Pro for Powerline 9")
    )
)

(setq-default tab-width 4 indent-tabs-mode nil)
(setq-default cursor-type 'box)
(custom-set-faces
  ;; custom-set-faces was added by Custom.
  ;; If you edit it by hand, you could mess it up, so be careful.
  ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(mode-line ((t (:background "#7F7F7F" :foreground "#8FB28F" :box nil)))) 
 '(js2-error ((((class color)) (:underline "red"))))
 '(js2-external-variable ((((class color)) (:underline "red"))))
 '(flymake-errline ((((class color)) (:underline "red"))))
 '(flymake-warnline ((((class color)) (:underline "yellow")))))
#+END_SRC
* Packages
** Projectile
  I use this to separate my working dirs into separate projects.
  #+BEGIN_SRC emacs-lisp
(use-package projectile
  :ensure t
  :init
  (setq projectile-enable-caching t)
  (setq projectile-sort-order 'recently-active)
  :config
  (projectile-global-mode)
  (add-to-list 'projectile-globally-ignored-directories "node_modules")
  (projectile-register-project-type 'ntropy '("pull_request_template.md")
                                  :project-file "Makefile"
                                  :compile "make"
                                  :test "make test"
                                  :install "make install"
                                  :test-prefix "test_"
                                  )

  :bind (
    :map global-map
    ("C-x C-S-p" . 'projectile-find-file-dwim)
    ("C-x C-p" . 'projectile-find-file)
    :map projectile-mode-map
    ("C-c p" . 'projectile-command-map)
  )
)
(use-package helm-projectile
  :ensure t
  :after (helm projectile)
  :init
  (setq projectile-completion-system 'helm)
)
  #+END_SRC
** Helm
  Find files in projects quickly, ag in project support, nicer M-x
  #+BEGIN_SRC emacs-lisp
(defun remove-helm-functions ()
  (remove-hook 'post-command-hook 'helm--maybe-update-keymap)
  ;; 2015-07-01 The following function was also remaining in the hook.
  ;; This hook was added 14 days ago coinciding breakage.
  ;; https://github.com/emacs-helm/helm/commit/ff7c54d39501d894fdb06e049828b291327540e6
  (remove-hook 'post-command-hook 'helm--update-header-line))

(use-package helm
  :after (projectile)
  :init
  (setq helm-buffers-fuzzy-matching t
        helm-echo-input-in-header-line t
        helm-ag-command-option "--smart-case --ignore=node_modules --ignore=elm-stuff --ignore=static"
        helm-bookmark-show-location t
        helm-display-header-line nil
        helm-split-window-in-side-p t
        helm-always-two-windows t
        helm-imenu-execute-action-at-once-if-one nil
        helm-org-format-outline-path t
  )
  :ensure t
  :config
  (helm-mode 1)
  ;(add-hook 'pre-command-hook 'remove-helm-functions)
  :bind (
    :map global-map
    ("M-x" . 'helm-M-x)
    ("M-y" . 'helm-show-kill-ring)
    ("C-x C-f" . 'helm-find-files)
    ("C-x b" . 'helm-buffers-list)
    :map helm-map
    ("<tab>" . 'helm-execute-persistent-action) ; rebind tab to run persistent action
    ("C-z" . 'helm-select-action) ; list actions using C-z
  )
)
  #+END_SRC
** Ag + Helm-Ag
  #+BEGIN_SRC emacs-lisp
(use-package ag
  :ensure t
  :config
  (setq ag-highlight-search t)
  (setq ag-reuse-buffers t)
)

(use-package helm-ag
  :ensure t
  :after (helm ag)
  :bind (
    :map global-map
    ("C-c p w" . 'helm-do-ag)
  )
)
  #+END_SRC
