.emacs.d/emacs-init.el

(defun run-projectile-invalidate-cache (&rest _args)
  ;; We ignore the args to `magit-checkout'.
  (projectile-invalidate-cache nil)
)

(defun magit-quit-session ()
  "Restores the previous window configuration and kills the magit buffer"
  (interactive)
  (kill-buffer)
  (jump-to-register :magit-fullscreen))

(defun dbu-rebase ()
  (interactive)
  (smartscan-mode 0)
  )

(defun my-magit-find-master ()
  "Visit a file in master brnach"
  (interactive)
  (let ((file (magit-read-file-from-rev "master" "Find file in master" buffer-file-name)))
    (magit-find-file "master" file))
  )

(defun my-magit-find-master-this ()
  "Visit this file in master brnach"
  (interactive)
  (magit-find-file "master" buffer-file-name)
  )

(defun my-magit-ediff-master-this ()
  "Ediff this file against master brnach"
  (interactive)
  (magit-ediff-compare nil "master" (magit-current-file) (magit-current-file))
  )

(defun my-magit-merge-preview ()
  "Preview result of merging REV into the current branch."
  (interactive)
  (setq rev "origin/master")
  (magit-mode-setup #'my-magit-merge-preview-mode rev))

(define-derived-mode my-magit-merge-preview-mode magit-diff-mode "Magit Merge"
  "Mode for previewing a merge."
  :group 'magit-diff
  (hack-dir-local-variables-non-file-buffer))

(defun my-magit-merge-preview-refresh-buffer (rev)
  (let* ((branch rev)
         (head (magit-get-current-branch)))
    (magit-set-header-line-format (format "Preview merge of %s into %s"
                                          (or branch "HEAD")
                                          rev))
    (magit-insert-section (diffbuf)
      (magit-git-wash #'magit-diff-wash-diffs
        "merge-tree" (magit-git-string "merge-base" rev head) rev head))))

(defun my-browse-url (url &rest args)
  (interactive (browse-url-interactive-arg "URL: "))
  (if (eq system-type 'darwin)
      (apply #'browse-url-default-macosx-browser url args)
    (apply #'browse-url url args)
  )
)

(use-package magit
  :after (projectile helm)
  :ensure t
  :init
  :config
  (advice-add 'magit-pull-from-upstream ; This is `F u'.
            :after #'run-projectile-invalidate-cache)
  (add-hook 'git-rebase-mode-hook 'dbu-rebase)
  (defadvice magit-status (around magit-fullscreen activate)
    (window-configuration-to-register :magit-fullscreen)
    ad-do-it
    (delete-other-windows))
  :bind (
    :map global-map
    ("C-S-g" . 'magit-status)
    ("C-x g" . 'magit-status)
    ("C-c m f" . 'magit-find-file)
    ("C-c m m" . 'my-magit-find-master)
    ("C-c m t" . 'my-magit-find-master-this)
    ("C-c m e" . 'my-magit-ediff-master-this)
    ("C-c m E" . 'magit-ediff-compare)
    ("C-c m b" . 'my-magit-merge-preview)
    :map magit-status-mode-map
    ("q" . 'magit-quit-session)
    :map magit-process-mode-map
    ("C-c C-o" . 'my-browse-url)
  )
)

(use-package keyfreq
  :ensure t
  :config
  (keyfreq-mode 1)
  (keyfreq-autosave-mode 1)
)

(use-package undo-tree
  :ensure t
  :config
  (undo-tree-mode 1)
)

(defun dbu-prettier()
  (interactive)
  (when (eq major-mode 'js2-mode) (prettier-js))
  (when (eq major-mode 'rjsx-mode) (prettier-js))
  )

(use-package prettier-js
  :ensure t
  :init
  (setq prettier-js-command
        "/home/david/.nvm/versions/node/v11.10.1/lib/node_modules/prettier/bin-prettier.js"
        )
  (setq prettier-js-args '(
                           "--single-quote"
                           "--no-semi"
                           ))
)

(defun dbu-js-settings()
  (add-hook 'before-save-hook 'dbu-prettier)
  (setq mode-name "JS2")
  (smartparens-mode 1)
  (js2-imenu-extras-mode)
  (flycheck-mode)
  (company-mode)
)

(use-package rjsx-mode
  :ensure t
  :after prettier-js
  :config
  (add-hook 'rjsx-mode-hook 'dbu-js-settings)
)

(use-package js2-mode
  :ensure t
  :after rjsx-mode
  :init
  (setq js2-use-font-lock-faces t
      js2-mode-must-byte-compile nil
      js2-idle-timer-delay 0.5 ;; could not be too big for real time syntax check
      js2-indent-on-enter-key t
      js2-skip-preprocessor-directives t
      js2-auto-indent-p t
      js2-strict-missing-semi-warning nil
      js2-basic-offset 2
      js2-bounce-indent-p t)
  :config
  (add-hook 'js2-mode-hook 'dbu-js-settings)
  (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
  :bind (
    ("M-j" . nil)
    ("C-c ." . 'ac-js2-jump-to-definition)
    ("RET" . 'newline-and-indent)
  )
)

(use-package smartscan :ensure t
  :config
  (global-smartscan-mode 1)
)

(use-package smartparens
  :ensure t
  :config
  (add-hook 'c-mode-hook (lambda () (smartparens-mode 1)))
  (add-hook 'python-mode-hook (lambda () (smartparens-mode 1)))
  (add-hook 'js2-mode-hook (lambda () (smartparens-mode 1)))
  (add-hook 'js-mode-hook (lambda () (smartparens-mode 1)))
  (add-hook 'emacs-lisp-mode-hook (lambda () (smartparens-mode 1)))
  (add-hook 'go-mode-hook (lambda () (smartparens-mode 1)))
)

(use-package jump-char
  :ensure t
  :bind
  ("M-m" . jump-char-forward)
  )

(use-package move-text
  :ensure t
  :bind (
    :map global-map
    ([M-S-down] . 'move-text-down)
    ([M-S-up] . 'move-text-up)
  )
)

(use-package expand-region
  :ensure t
  :bind (
    :map global-map
    ("M-s-SPC" . 'er/expand-region)
    ("C-c a" . 'er/expand-region)
  )
  )

(use-package jumplist
  :ensure t
  :config
  (setq jumplist-hook-commands
   '(move-beginning-of-line
     end-of-visual-line
     beginning-of-defun end-of-defun
     end-of-buffer beginning-of-buffer
     sp-forward-sexp sp-backward-sexp
     helm-swoop helm-imenu helm-find-files helm-multi-files
     helm-projectile-switch-project helm-projectile-find-file
     find-function find-variable
     mark-defun mark-whole-buffer
     avy-goto-char avy-goto-char-2
     helm-gtags-find-pattern helm-gtags-find-tag-adapter helm-gtags-find-rtag-adapter
     helm-ag-select-directory
     ensime-edit-definition
     ensime-edit-definition-with-fallback
     isearch-forward))
  (setq jumplist-ex-mode t)
  :bind (
    :map global-map
    ("C->" . 'jumplist-next)
    ("C-<" . 'jumplist-previous)
  )
)

(use-package multiple-cursors
  :ensure t
  :bind (
    :map global-map
    ("C-S-<mouse-1>" . 'mc/add-cursor-on-click)
    ("C-?" . 'mc/mark-next-like-this)
    ("M-?" . 'mc/mark-all-like-this-dwim)
    ("M-!" . 'mc/mark-next-symbol-like-this)
    ("C-M-SPC" . 'set-rectangular-region-anchor)
  )
)

(use-package yasnippet
  :config
  (add-to-list 'yas-snippet-dirs "~/dotfiles/.emacs.d/yasnippet")
)

(use-package auto-complete
  :ensure t
  :init
  (setq ac-auto-show-menu    0.2)
  (setq ac-delay             0.2)
  (setq ac-fuzzy-enable      t)
  (setq ac-menu-height       20)
  (setq ac-auto-start t)
  (setq ac-show-menu-immediately-on-auto-complete t)
  :config
  (add-to-list 'ac-dictionary-directories "~/dotfiles/.emacs.d/ac-dict")
  (ac-flyspell-workaround)
  ;; (setq-default ac-sources '(ac-source-abbrev ac-source-dictionary ac-source-words-in-same-mode-buffers))
  ;; (add-hook 'emacs-lisp-mode-hook 'ac-emacs-lisp-mode-setup)
  ;; (add-hook 'c-mode-common-hook 'ac-cc-mode-setup)
  ;; (add-hook 'ruby-mode-hook 'ac-ruby-mode-setup)
  ;; (add-hook 'css-mode-hook 'ac-css-mode-setup)
  ;; (add-hook 'auto-complete-mode-hook 'ac-common-setup)
  :bind (:map ac-complete-mode-map
    ("C-n" . ac-next)
    ("C-p" . ac-previous)
    )
)
