.emacs.d/emacs-init.org
** company
#+BEGIN_SRC emacs-lisp
(use-package company :ensure t
  :config
  (defun my-company-visible-and-explicit-action-p ()
    (and (company-tooltip-visible-p)
         (company-explicit-action-p)))
  (setq company-require-match nil)
  (setq company-idle-delay 0.2)
  (setq company-tooltip-limit 20)
  (setq company-auto-complete #'my-company-visible-and-explicit-action-p)
  (setq company-frontends
      '(company-pseudo-tooltip-unless-just-one-frontend
        company-preview-frontend
        company-echo-metadata-frontend))
  (setq company-minimum-prefix-length 1)
  ;; (define-key company-active-map (kbd "TAB") 'company-complete-selection)
  ;; (define-key company-active-map [tab] 'company-complete-selection)
  :custom-face
  (company-template-field ((t (:foreground "#DFAF8F" :background "#2B2B2B"))))
  :bind (:map company-active-map
    ("C-n" . (lambda () (interactive) (company-complete-common-or-cycle 1)))
    ("C-p" . (lambda () (interactive) (company-complete-common-or-cycle -1)))
    ;; ("C-f" . (lambda () (interactive)
    ;;            (if (= company-candidates-length 1)
    ;;                (company-complete-selection)
    ;;              (company-abort)
    ;;                )
    ;;            )
    ("C-p" . (lambda () (interactive) (company-complete-common-or-cycle -1)))
    ("TAB" . (lambda () (interactive) (company-complete-selection)))
    ([tab] . (lambda () (interactive) (company-complete-selection)))
    ("C-h" . nil)
    ("RET" . nil)
    ("<return>" . nil)
    ("C-<return>" . (lambda () (interactive) (company-complete-selection)))
    ;:map company-search-map
    ;([?\t] . company-complete-selection)
  )
)
#+END_SRC
** lsp
#+BEGIN_SRC emacs-lisp
(use-package lsp-mode
  :ensure t
  :diminish
  :config
  (setq lsp-clients-go-format-tool "gofmt")
  (setq lsp-eldoc-enable-hover nil)
  (setq lsp-enable-indentation nil)
  (setq lsp-enable-symbol-highlighting nil)
  (setq lsp-headerline-breadcrumb-enable nil)
  (setq lsp-enable-snippet nil)
  (setq lsp-eldoc-prefer-signature-help nil)
  (setq lsp-enable-links nil)
  (setq lsp-signature-auto-activate nil)
  (setq lsp-enable-semantic-highlighting nil)
)

#+END_SRC
** anzu
#+BEGIN_SRC emacs-lisp
(use-package anzu
  :ensure t
  :diminish
  :bind (:map global-map
    ("M-%" . #'anzu-query-replace-regexp)
  )
  )
#+END_SRC
** jedi
#+BEGIN_SRC emacs-lisp
(use-package jedi
  :ensure t
  :config
  (setq jedi:server-command (list "python3" jedi:server-script))
)
#+END_SRC
** python-mode
#+BEGIN_SRC emacs-lisp
(defun dbu-python-settings ()
  (setq show-trailing-whitespace t)
  (setq tab-width 4
        py-indent-offset 4
        indent-tabs-mode nil)
  (lsp)
  (jedi-mode 1)
  ;(auto-complete-mode 1)
  (company-mode 1)
 (subword-mode 1)
  ; do not breakline on comments
  (set (make-local-variable 'fill-nobreak-predicate)
       (lambda ()
         (not (eq (get-text-property (point) 'face)
                  'font-lock-comment-face))))
  (yas/minor-mode-on)
  (flycheck-mode 1)
  (smartparens-mode 1)
;  (add-hook 'lsp-on-idle-hook #'flycheck-display-error-at-point t)
)

(use-package python-pytest
  :ensure t
  :config
  (require 'cl-lib)
  (cl-defun python-pytest--run-as-comint (&key command)
    (projectile-run-compilation command)
  )
  (defun python-pytest--switch-to-option (args name on-replacement off-replacement)
    (if (-contains-p args name)
        (-replace name off-replacement args)
      (-snoc args off-replacement))
  )
)

(use-package python
  :after (company-tabnine jedi python-pytest)
  :config
  (add-hook 'python-mode-hook 'dbu-python-settings)
  (add-to-list 'auto-mode-alist '("\\.tac\\'" . python-mode))
  (add-to-list 'auto-mode-alist '("^BUILD$" . python-mode))
  (setq python-shell-interpreter "ipython")
  :bind (
    :map python-mode-map
    ("C-c ," . 'xref-pop-marker-stack)
    ("C-c ." . 'xref-find-definitions)
    ("C-c u" . 'lsp-find-references)
    ("\C-m" . 'newline-and-indent)
    ("C-x c t" . 'python-pytest-function-dwim)
    ("C-x c f" . 'python-pytest-file-dwim)
    ("C-x c d" . 'python-pytest-dispatch)
  )
)
#+END_SRC
** go-guru + go-dlv + go-impl + go-rename + go-repl + gotest
#+BEGIN_SRC emacs-lisp
(use-package go-guru :ensure t
  :config
  (defun go-guru-set-current-package-as-main ()
    (interactive)
    (let* ((filename (buffer-file-name))
           (gopath-src-path (concat (file-name-as-directory (go-guess-gopath)) "src"))
           (relative-package-path (directory-file-name (file-name-directory (file-relative-name filename gopath-src-path)))))
      (setq go-guru-scope relative-package-path)))
)


(use-package go-dlv :ensure t)

(use-package go-impl
  :ensure t
)

(use-package go-rename
  :ensure t
)

(use-package gotest
  :ensure t
)

(use-package gorepl-mode
  :ensure t
)

#+END_SRC
** flycheck
#+BEGIN_SRC emacs-lisp
(use-package flycheck :ensure t
  :init
  (setq flycheck-display-errors-delay 0.1)
  (setq flycheck-highlighting-mode 'lines)
  (setq flycheck-checker-error-threshold 10000)
  :config
  (flycheck-add-mode 'javascript-eslint 'web-mode)
  (setq-default flycheck-disabled-checkers
   (append flycheck-disabled-checkers
	   '(javascript-jshint)))
  (setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
	  '(json-jsonlist)))
  (setq-default flycheck-temp-prefix ".flycheck")

  :config
  (flycheck-define-checker npm-groovy-lint
  "A groovy syntax checker using groovy compiler API.
  See URL `http://www.groovy-lang.org'."
    :command ("/home/david/.nvm/versions/node/v12.14.0/bin/node" "/home/david/.nvm/versions/node/v12.14.0/bin/npm-groovy-lint" "--no-insight")
    :standard-input t
    :error-patterns
    ((error line-start "  " line (one-or-more not-newline) "[39m  " (message) line-end))
    :modes groovy-mode)
  (add-to-list 'flycheck-checkers 'npm-groovy-lint)

)
#+END_SRC
** go-mode + gotests + go-autocomplete
#+BEGIN_SRC emacs-lisp
(load-file "~/dotfiles/.emacs.d/gotests.el")
(load-file "~/dotfiles/.emacs.d/go-autocomplete.el")

(defun dbu-go-settings ()
  (subword-mode 1)
  (setq-local flycheck-disabled-checkers '(go-unconvert go-golint go-megacheck go-errcheck))
  (flycheck-mode 1)
  (auto-complete-mode 0)
  (company-mode 1)
  (set (make-local-variable 'ac-sources) (cons '(ac-source-go) '()))
  (add-hook 'before-save-hook #'gofmt-before-save)
  (setq show-trailing-whitespace t)
  (set (make-local-variable 'semantic-mode) nil)
)

(use-package go-mode
  :init
  :ensure t
  :after (go-guru flycheck gorepl-mode go-impl go-rename gotest company-tabnine)
  :config
  (add-hook 'go-mode-hook 'dbu-go-settings)
  :bind (
    :map go-mode-map
    ("C-c ," . xref-pop-marker-stack)
    ("C-c ." . godef-jump)
    ("C-c u" . go-guru-referrers)
    ("C-c t" . gotests-region)
    ("C-m" . 'newline-and-indent)
    ;("C-c a" . 'go-guru-expand-region)
    ("C-x c i" . 'helm-imenu)
    ("C-x c r" . 'go-rename)
    ("C-x c t" . 'go-test-current-test)
    ("C-x c f" . 'go-test-current-file)
    :map global-map
    ("C-'" . 'forward-or-backward-sexp)
  )
)
#+END_SRC
** grade-mode + groovy-mode
#+BEGIN_SRC emacs-lisp
(use-package gradle-mode
  :ensure t
  )

(defun dbu-groovy-settings ()
  (setq-default groovy-indent-offset 2)
  (setq-local company-backends '(company-tabnine))
  (company-mode 1)
  (flycheck-mode 1)
)

(use-package groovy-mode
  :ensure t
  :after (company-tabnine)
  :config
  (add-hook 'groovy-mode-hook 'dbu-groovy-settings)
  )

#+END_SRC
** elm-mode + flycheck-elm
#+BEGIN_SRC emacs-lisp
(defun dbu-elm-settings ()
  (setq elm-format-on-save t)
  (setq-local company-backends '(company-tabnine))
  (flycheck-mode)
  (company-mode)
  (flycheck-elm-setup)
)

(use-package flycheck-elm
  :ensure t
)

(use-package elm-mode
  :ensure t
  :after (flycheck-elm)
  :config
  (add-hook 'elm-mode-hook 'dbu-elm-settings)
)
#+END_SRC
** C++
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.cpp\\'" . c++-mode))
(add-to-list 'auto-mode-alist '("\\.hpp\\'" . c++-mode))

;C++ Settings.
(defun my-cpp-settings ()
  (subword-mode 1)
  (setq show-trailing-whitespace t)
  (c-set-offset 'substatement-open '0)
  (setq c++-tab-always-indent t)
  (setq c-indent-level 4)
  (setq c-basic-offset 4)
  (setq c-continued-statement-offset 4)
  (setq c++-empty-arglist-indent 4)
  (setq tab-width 4 indent-tabs-mode nil)
  (define-key c++-mode-map "\C-m" 'reindent-then-newline-and-indent)
  (define-key c++-mode-map "\C-ce" 'c-comment-edit)
  (setq c++-auto-hungry-initial-state 'none)
  (setq c++-delete-function 'backward-delete-char)
  (set (make-local-variable 'ac-sources)
       (append ac-sources '(ac-source-gccsense-member) 
                          '(ac-source-gccsense-static-member)))
  (auto-complete-mode 1)
)
(add-hook 'c++-mode-hook 'my-cpp-settings)
#+END_SRC
