.emacs.d/emacs-init.el

(use-package company :ensure t
  :config
  (defun my-company-visible-and-explicit-action-p ()
    (and (company-tooltip-visible-p)
         (company-explicit-action-p)))
  (setq company-require-match nil)
  (setq company-idle-delay 0.2)
  (setq company-tooltip-limit 20)
  (setq company-auto-complete #'my-company-visible-and-explicit-action-p)
  (setq company-frontends
      '(company-pseudo-tooltip-unless-just-one-frontend
        company-preview-frontend
        company-echo-metadata-frontend))
  (setq company-minimum-prefix-length 1)
  ;; (define-key company-active-map (kbd "TAB") 'company-complete-selection)
  ;; (define-key company-active-map [tab] 'company-complete-selection)
  :custom-face
  (company-template-field ((t (:foreground "#DFAF8F" :background "#2B2B2B"))))
  :bind (:map company-active-map
    ("C-n" . (lambda () (interactive) (company-complete-common-or-cycle 1)))
    ("C-p" . (lambda () (interactive) (company-complete-common-or-cycle -1)))
    ;; ("C-f" . (lambda () (interactive)
    ;;            (if (= company-candidates-length 1)
    ;;                (company-complete-selection)
    ;;              (company-abort)
    ;;                )
    ;;            )
    ("C-p" . (lambda () (interactive) (company-complete-common-or-cycle -1)))
    ("TAB" . (lambda () (interactive) (company-complete-selection)))
    ([tab] . (lambda () (interactive) (company-complete-selection)))
    ("C-h" . nil)
    ;:map company-search-map
    ;([?\t] . company-complete-selection)
  )
)

(use-package lsp-mode
  :ensure t
  :diminish
  :config
  (setq lsp-clients-go-format-tool "gofmt")
)

(use-package company-lsp
  :ensure t
  :after company lsp-mode
  :init
  (push 'company-lsp company-backends)
)

(use-package anzu
  :ensure t
  :diminish
  :bind (:map global-map
    ("M-%" . #'anzu-query-replace-regexp)
  )
  )

(use-package pyfmt :ensure t)

(use-package jedi :ensure t)

(defun dbu-python-settings ()
  (setq show-trailing-whitespace t)
  (setq tab-width 4
        py-indent-offset 4
        indent-tabs-mode nil)
  (jedi-mode 1)
  ;(auto-complete-mode 1)
  (company-mode 1)
  (subword-mode 1)
  ; do not breakline on comments
  (set (make-local-variable 'fill-nobreak-predicate)
       (lambda ()
         (not (eq (get-text-property (point) 'face)
                  'font-lock-comment-face))))
  (yas/minor-mode-on)
  (flycheck-mode 1)
  (smartparens-mode 1)
)

(use-package python-mode
  :ensure t
  :after (company-tabnine pyfmt jedi)
  :config
  (add-hook 'python-mode-hook 'dbu-python-settings)
  (add-to-list 'auto-mode-alist '("\\.tac\\'" . python-mode))
  (add-to-list 'auto-mode-alist '("^BUILD$" . python-mode))
  (setq python-shell-interpreter "ipython")
  :bind (
    :map python-mode-map
    ("C-c ," . 'xref-pop-marker-stack)
    ("C-c ." . 'jedi:goto-definition)
    ("\C-m" . 'newline-and-indent)
  )
)

(use-package go-guru :ensure t
  :config
  (defun go-guru-set-current-package-as-main ()
    (interactive)
    (let* ((filename (buffer-file-name))
           (gopath-src-path (concat (file-name-as-directory (go-guess-gopath)) "src"))
           (relative-package-path (directory-file-name (file-name-directory (file-relative-name filename gopath-src-path)))))
      (setq go-guru-scope relative-package-path)))
)


(use-package go-dlv :ensure t)

(use-package go-impl
  :ensure t
)

(use-package go-rename
  :ensure t
)

(use-package gotest
  :ensure t
)

(use-package gorepl-mode
  :ensure t
)

(use-package flycheck :ensure t
  :init
  (setq flycheck-display-errors-delay 0.1)
  (setq flycheck-highlighting-mode 'lines)
  (setq flycheck-checker-error-threshold 10000)
  :config
  (flycheck-add-mode 'javascript-eslint 'web-mode)
  (setq-default flycheck-disabled-checkers
   (append flycheck-disabled-checkers
	   '(javascript-jshint)))
  (setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
	  '(json-jsonlist)))
  (setq-default flycheck-temp-prefix ".flycheck")
  (setq-default flycheck-pylintrc "~/dotfiles/pylintrc")
)

(load-file "~/dotfiles/.emacs.d/gotests.el")
(load-file "~/dotfiles/.emacs.d/go-autocomplete.el")

(defun dbu-go-settings ()
  (subword-mode 1)
  (setq-local flycheck-disabled-checkers '(go-unconvert go-golint go-megacheck go-errcheck))
  (flycheck-mode 1)
  (auto-complete-mode 0)
  (company-mode 1)
  (set (make-local-variable 'ac-sources) (cons '(ac-source-go) '()))
  (add-hook 'before-save-hook #'gofmt-before-save)
  (setq show-trailing-whitespace t)
  (set (make-local-variable 'semantic-mode) nil)
)

(use-package go-mode
  :init
  :ensure t
  :after (go-guru flycheck gorepl-mode go-impl go-rename gotest company-tabnine)
  :config
  (add-hook 'go-mode-hook 'dbu-go-settings)
  :bind (
    :map go-mode-map
    ("C-c ," . xref-pop-marker-stack)
    ("C-c ." . godef-jump)
    ("C-c u" . go-guru-referrers)
    ("C-c t" . gotests-region)
    ("C-m" . 'newline-and-indent)
    ;("C-c a" . 'go-guru-expand-region)
    ("C-x c i" . 'helm-imenu)
    ("C-x c r" . 'go-rename)
    ("C-x c t" . 'go-test-current-test)
    ("C-x c f" . 'go-test-current-file)
    :map global-map
    ("C-'" . 'forward-or-backward-sexp)
  )
)

(use-package gradle-mode
  :ensure t
  )

(use-package groovy-mode
  :ensure t
  )

(defun dbu-elm-settings ()
  (setq elm-format-on-save t)
  (setq-local company-backends '(company-tabnine))
  (flycheck-mode)
  (company-mode)
  (flycheck-elm-setup)
)

(use-package flycheck-elm
  :ensure t
)

(use-package elm-mode
  :ensure t
  :after (flycheck-elm)
  :config
  (add-hook 'elm-mode-hook 'dbu-elm-settings)
)

(add-to-list 'auto-mode-alist '("\\.cpp\\'" . c++-mode))
(add-to-list 'auto-mode-alist '("\\.hpp\\'" . c++-mode))

;C++ Settings.
(defun my-cpp-settings ()
  (subword-mode 1)
  (setq show-trailing-whitespace t)
  (c-set-offset 'substatement-open '0)
  (setq c++-tab-always-indent t)
  (setq c-indent-level 4)
  (setq c-basic-offset 4)
  (setq c-continued-statement-offset 4)
  (setq c++-empty-arglist-indent 4)
  (setq tab-width 4 indent-tabs-mode nil)
  (define-key c++-mode-map "\C-m" 'reindent-then-newline-and-indent)
  (define-key c++-mode-map "\C-ce" 'c-comment-edit)
  (setq c++-auto-hungry-initial-state 'none)
  (setq c++-delete-function 'backward-delete-char)
  (set (make-local-variable 'ac-sources)
       (append ac-sources '(ac-source-gccsense-member) 
                          '(ac-source-gccsense-static-member)))
  (auto-complete-mode 1)
)
(add-hook 'c++-mode-hook 'my-cpp-settings)
