.emacs.d/emacs-init.org
** lisp-mode
#+BEGIN_SRC emacs-lisp
(defun my-lisp-settings ()
  (company-mode 1)
  (setq-local company-backends '(company-elisp))
)

(use-package lisp-mode
  :bind (
    ("C-c ." . 'xref-find-definitions)
    ("C-c ," . 'xref-pop-marker-stack)
    )
  :hook
  (lisp-mode . company-mode)
  (emacs-lisp-mode . company-mode)
  (emacs-lisp-mode . my-lisp-settings)
)
#+END_SRC
** avy
#+BEGIN_SRC emacs-lisp
(use-package avy
  :ensure t
  :bind (
    :map global-map
    ("C-;" . 'avy-goto-char-2)
  )
)
#+END_SRC
** company-tabnine
#+BEGIN_SRC emacs-lisp
(use-package company-tabnine
  :ensure t
  :config
  (setq custom-tabnine-always-trigger nil)
  (setq company-tabnine-insert-arguments t)
  (setq company-tabnine-log-file-path "/tmp/tabnine.log")
  (setq company-tabnine-install-static-binary t)
  :init
  (push 'company-tabnine company-backends)
)
#+END_SRC
** irony + company-irony
#+BEGIN_SRC emacs-lisp
(use-package irony
  :ensure t
  :defer t
  :init
  (dolist (a-mode-hook '(c-mode-hook objc-mode-hook c++-mode-hook))
    (add-hook a-mode-hook 'irony-mode))
  :config
  (use-package company-irony
    :ensure t
    :config
    (defun my-company-irony-hook()
      (add-to-list 'company-backends 'company-irony)
      (define-key company-mode-map [remap hippie-expand]
        'company-complete))
    (add-hook 'irony-mode-hook 'my-company-irony-hook))
  (use-package flycheck-irony
    :ensure t
    :config
    (add-hook 'flycheck-mode-hook #'flycheck-irony-setup))
  (use-package irony-eldoc
    :ensure t
    :config
    (add-hook 'irony-mode-hook 'irony-eldoc)))
#+END_SRC
** which-key
#+BEGIN_SRC emacs-lisp
(use-package which-key :ensure t
  :commands (which-key-mode)
  :diminish
  )

(which-key-mode)
#+END_SRC
** org-caldav
#+BEGIN_SRC emacs-lisp
(use-package org-caldav
  :ensure t
  :config
  (setq org-caldav-url 'google
    org-caldav-resume-aborted 'always
    org-icalendar-timezone "Europe/Berlin"
    org-icalendar-include-body nil
  )
  (setq org-caldav-calendars
  '((:calendar-id "david.buchmann@gmail.com" :files ("~/Dropbox/org/calendar.org")
     :inbox "~/Dropbox/org/fromhome.org")
   ))
  (setq plstore-cache-passphrase-for-symmetric-encryption t)
  (setq org-caldav-oauth2-available t)
)
(use-package oauth2
  :ensure t
)
#+END_SRC
** terraform-mode
#+BEGIN_SRC emacs-lisp
(use-package terraform-mode
  :ensure t
)
#+END_SRC
** emacs-python-black
#+BEGIN_SRC emacs-lisp
 (use-package python-black
  :ensure t
  :config
  (add-hook 'python-mode-hook #'python-black-on-save-mode)
 )
#+END_SRC
** py-isort
#+BEGIN_SRC emacs-lisp
  (use-package py-isort
   :ensure t
   :config
   ;; (add-hook 'before-save-hook #'py-isort-before-save)
  )
#+END_SRC
** filladapt
#+BEGIN_SRC emacs-lisp
(use-package filladapt
  :ensure t
  :config
  (setq-default filladapt-mode t)
)
#+END_SRC
** dockerfile
#+BEGIN_SRC emacs-lisp
(use-package dockerfile-mode
  :ensure t
)
#+END_SRC
** poetry
#+BEGIN_SRC emacs-lisp
(use-package poetry
  :ensure t
)
#+END_SRC
** rust
#+BEGIN_SRC emacs-lisp
(defun dbu-rust-settings ()
  (lsp)
  (setq-local company-backends '(company-tabnine))
  (subword-mode 1)
  (flycheck-mode 1)
  (auto-complete-mode 0)
  (company-mode 1)
  (setq show-trailing-whitespace t)
  (set (make-local-variable 'semantic-mode) nil)
  (setq-local company-backends '(company-tabnine))
  (add-hook 'before-save-hook 'lsp-format-buffer nil t)
)

(use-package flycheck-inline
  :ensure t
)

(use-package cargo
  :ensure t
  :hook (rust-mode . cargo-minor-mode)
)

(use-package flycheck-rust
  :ensure t
  :config
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
)

(use-package rust-mode
  :ensure t
  :config
  (add-hook 'rust-mode-hook 'dbu-rust-settings)
)
#+END_SRC
** org-jira
#+BEGIN_SRC emacs-lisp
(use-package org-jira
  :ensure t
  :config
  (setq jiralib-url "https://cognitedata.atlassian.net")
  (setq org-jira-use-status-as-todo t)
  :hook (org-mode . org-jira-mode)
)
#+END_SRC
** jsonnet
#+BEGIN_SRC emacs-lisp
(use-package jsonnet-mode
  :ensure t
)
#+END_SRC
** csv
#+BEGIN_SRC emacs-lisp
(use-package csv-mode
  :ensure t
)
#+END_SRC
** ace-window
#+BEGIN_SRC emacs-lisp
(use-package ace-window
   :ensure t
   :config
   (global-set-key (kbd "C-M-o") 'ace-window)
)
#+END_SRC
** doom-modeline
#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode 1)
  (setq doom-modeline-major-mode-icon t)
  :custom
  ((doom-modeline-height 15))
)
#+END_SRC
** 
#+BEGIN_SRC emacs-lisp
#+END_SRC
* Load work config
#+BEGIN_SRC emacs-lisp
(let
    ((work "~/Dropbox/org/work.el"))
  (when
      (file-exists-p work)
    (load-file work)
  )
)
#+END_SRC

