.emacs.d/emacs-init.el

(defun my-lisp-settings ()
  (company-mode 1)
  (setq-local company-backends '(company-elisp))
)

(use-package lisp-mode
  :bind (
    ("C-c ." . 'xref-find-definitions)
    ("C-c ," . 'xref-pop-marker-stack)
    )
  :hook
  (lisp-mode . company-mode)
  (emacs-lisp-mode . company-mode)
  (emacs-lisp-mode . my-lisp-settings)
)

(use-package avy
  :ensure t
  :bind (
    :map global-map
    ("C-;" . 'avy-goto-char-2)
  )
)

(use-package company-tabnine
  :ensure t
  :config
  (setq custom-tabnine-always-trigger nil)
  (setq company-tabnine-insert-arguments nil)
  :init
  (push 'company-tabnine company-backends)
)

(use-package irony
  :ensure t
  :defer t
  :init
  (dolist (a-mode-hook '(c-mode-hook objc-mode-hook c++-mode-hook))
    (add-hook a-mode-hook 'irony-mode))
  :config
  (use-package company-irony
    :ensure t
    :config
    (defun my-company-irony-hook()
      (add-to-list 'company-backends 'company-irony)
      (define-key company-mode-map [remap hippie-expand]
        'company-complete))
    (add-hook 'irony-mode-hook 'my-company-irony-hook))
  (use-package flycheck-irony
    :ensure t
    :config
    (add-hook 'flycheck-mode-hook #'flycheck-irony-setup))
  (use-package irony-eldoc
    :ensure t
    :config
    (add-hook 'irony-mode-hook 'irony-eldoc)))

(use-package which-key :ensure t
  :commands (which-key-mode)
  :diminish
  )

(which-key-mode)

(use-package org-caldav
  :ensure t
  :config
  (setq org-caldav-url 'google
    org-caldav-resume-aborted 'always
    org-icalendar-timezone "Europe/Berlin"
    org-icalendar-include-body nil
  )
  (setq org-caldav-calendars
  '((:calendar-id "david.buchmann@gmail.com" :files ("~/Dropbox/org/calendar.org")
     :inbox "~/Dropbox/org/fromhome.org")
   ))
  (setq plstore-cache-passphrase-for-symmetric-encryption t)
  (setq org-caldav-oauth2-available t)
)
(use-package oauth2
  :ensure t
)

(use-package terraform-mode
  :ensure t
)

(use-package python-black
 :ensure t
 :config
 (add-hook 'python-mode-hook #'python-black-on-save-mode)
)

(use-package py-isort
 :ensure t
 :config
 (add-hook 'before-save-hook #'py-isort-before-save)
)

(use-package filladapt
  :ensure t
  :config
  (setq-default filladapt-mode t)
)

(use-package dockerfile-mode
  :ensure t
)

(use-package poetry
  :ensure t
)

(defun dbu-rust-settings ()
  (subword-mode 1)
  (flycheck-mode 1)
  (auto-complete-mode 0)
  (company-mode 1)
  (setq show-trailing-whitespace t)
  (set (make-local-variable 'semantic-mode) nil)
  (setq-local company-backends '(company-tabnine company-lsp))
  (add-hook 'before-save-hook 'lsp-format-buffer nil t)
)

(use-package flycheck-inline
  :ensure t
)

(use-package cargo
  :ensure t
  :hook (rust-mode . cargo-minor-mode)
)

(use-package flycheck-rust
  :ensure t
  :config
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
)

(use-package rust-mode
  :ensure t
  :config
  (add-hook 'rust-mode-hook 'dbu-rust-settings)
  :hook (rust-mode . lsp)
)



(let
    ((work "~/Dropbox/org/work.el"))
  (when
      (file-exists-p work)
    (load-file work)
  )
)
